In [148]:
import pandas as pd
import numpy as np

# Set random seed for reproducibility
np.random.seed(2024)

# Create a mock dataset
data = {
    'order_id': range(1, 11),
    'customer_id': np.random.randint(1000, 1020, size=10),
    'product_id': np.random.randint(100, 110, size=10),
    'quantity': np.random.randint(1, 5, size=10),
    'price': np.random.uniform(10.0, 100.0, size=10),
    'order_date': pd.date_range(start='2021-01-01', periods=10, freq='D')
}

df = pd.DataFrame(data)
print(df)

   order_id  customer_id  product_id  quantity      price order_date
0         1         1008         105         3  29.325423 2021-01-01
1         2         1000         101         4  32.731698 2021-01-02
2         3         1000         107         2  67.374953 2021-01-03
3         4         1004         107         3  53.093335 2021-01-04
4         5         1009         106         4  74.511018 2021-01-05
5         6         1001         102         3  70.628991 2021-01-06
6         7         1003         107         4  48.263789 2021-01-07
7         8         1010         109         2  71.342279 2021-01-08
8         9         1002         106         2  66.276559 2021-01-09
9        10         1000         104         2  70.429624 2021-01-10

**1. Basic Data Exploration**

In [149]:
# Task 1.1 Display the data types of each column in the DataFrame

datatypes = df.dtypes
datatypes

order_id                int64
customer_id             int32
product_id              int32
quantity                int32
price                 float64
order_date     datetime64[ns]
dtype: object

In [150]:
# Task 1.2 Calculate basic statistics (mean, min, max) for the ‘quantity’ column

print("Mean of quantity column is: " + str(df["quantity"].mean()))
print("Max of quantity column is: " + str(df["quantity"].max()))
print("Min of quantity column is: " + str(df["quantity"].min()))

Mean of quantity column is: 2.9
Max of quantity column is: 4
Min of quantity column is: 2

In [151]:

df.isna()

   order_id  customer_id  product_id  quantity  price  order_date
0     False        False       False     False  False       False
1     False        False       False     False  False       False
2     False        False       False     False  False       False
3     False        False       False     False  False       False
4     False        False       False     False  False       False
5     False        False       False     False  False       False
6     False        False       False     False  False       False
7     False        False       False     False  False       False
8     False        False       False     False  False       False
9     False        False       False     False  False       False

In [152]:
# Task 1.3 Check if there are any missing values in the DataFrame

df.isna()

if df.isna().values.any():
    print("Something is missing")
else:
    print("No missing values in this dataframe.")

No missing values in this dataframe.

#### 2. Data Manipulation & Arithmetic

In [153]:
# Task 2.1 Create a new column ‘total_amount’ by multiplying ‘quantity’ and ‘price’

df["total_amount"] = df["quantity"] * df["price"]

print("New table with total amount:")
df

New table with total amount:

,order_id,customer_id,product_id,quantity,price,order_date,total_amount
0,1,1008,105,3,29.325423,2021-01-01,87.976268
1,2,1000,101,4,32.731698,2021-01-02,130.926791
2,3,1000,107,2,67.374953,2021-01-03,134.749905
3,4,1004,107,3,53.093335,2021-01-04,159.280006
4,5,1009,106,4,74.511018,2021-01-05,298.044073
5,6,1001,102,3,70.628991,2021-01-06,211.886972
6,7,1003,107,4,48.263789,2021-01-07,193.055157
7,8,1010,109,2,71.342279,2021-01-08,142.684558
8,9,1002,106,2,66.276559,2021-01-09,132.553117
9,10,1000,104,2,70.429624,2021-01-10,140.859247

In [154]:
# Task 2.2 Calculate the daily revenue (sum of total_amount) and store it in a new Series

#groupby() gathers all rows tha tshare same date into a group

daily_rev = df.groupby('order_date')['total_amount'].sum()
daily_rev

order_date
2021-01-01     87.976268
2021-01-02    130.926791
2021-01-03    134.749905
2021-01-04    159.280006
2021-01-05    298.044073
2021-01-06    211.886972
2021-01-07    193.055157
2021-01-08    142.684558
2021-01-09    132.553117
2021-01-10    140.859247
Name: total_amount, dtype: float64

In [155]:
# Task 2.3 Add 5% tax to all prices and store in a new column ‘price_with_tax’

df["price_with_tax"] = 1.05 * df["total_amount"] 
df

,order_id,customer_id,product_id,quantity,price,order_date,total_amount,price_with_tax
0,1,1008,105,3,29.325423,2021-01-01,87.976268,92.375082
1,2,1000,101,4,32.731698,2021-01-02,130.926791,137.473131
2,3,1000,107,2,67.374953,2021-01-03,134.749905,141.487400
3,4,1004,107,3,53.093335,2021-01-04,159.280006,167.244006
4,5,1009,106,4,74.511018,2021-01-05,298.044073,312.946277
5,6,1001,102,3,70.628991,2021-01-06,211.886972,222.481321
6,7,1003,107,4,48.263789,2021-01-07,193.055157,202.707914
7,8,1010,109,2,71.342279,2021-01-08,142.684558,149.818786
8,9,1002,106,2,66.276559,2021-01-09,132.553117,139.180773
9,10,1000,104,2,70.429624,2021-01-10,140.859247,147.902209

In [156]:
# Task 2.4 Find orders where the quantity is above the mean quantity

mean_quantity = df["quantity"].mean()

orders_above = df[df["quantity"] > mean_quantity]

print("The following dataframe has above average quantity orders:")
orders_above

The following dataframe has above average quantity orders:

,order_id,customer_id,product_id,quantity,price,order_date,total_amount,price_with_tax
0,1,1008,105,3,29.325423,2021-01-01,87.976268,92.375082
1,2,1000,101,4,32.731698,2021-01-02,130.926791,137.473131
3,4,1004,107,3,53.093335,2021-01-04,159.280006,167.244006
4,5,1009,106,4,74.511018,2021-01-05,298.044073,312.946277
5,6,1001,102,3,70.628991,2021-01-06,211.886972,222.481321
6,7,1003,107,4,48.263789,2021-01-07,193.055157,202.707914

#### 3. Sorting & Ranking

In [157]:
# Task 3.1 Sort the DataFrame by total_amount in descending order

descending_sort = df.sort_values("total_amount", ascending= False)
descending_sort

,order_id,customer_id,product_id,quantity,price,order_date,total_amount,price_with_tax
4,5,1009,106,4,74.511018,2021-01-05,298.044073,312.946277
5,6,1001,102,3,70.628991,2021-01-06,211.886972,222.481321
6,7,1003,107,4,48.263789,2021-01-07,193.055157,202.707914
3,4,1004,107,3,53.093335,2021-01-04,159.280006,167.244006
7,8,1010,109,2,71.342279,2021-01-08,142.684558,149.818786
9,10,1000,104,2,70.429624,2021-01-10,140.859247,147.902209
2,3,1000,107,2,67.374953,2021-01-03,134.749905,141.487400
8,9,1002,106,2,66.276559,2021-01-09,132.553117,139.180773
1,2,1000,101,4,32.731698,2021-01-02,130.926791,137.473131
0,1,1008,105,3,29.325423,2021-01-01,87.976268,92.375082

In [158]:
# 3.2 Rank the orders based on their price (highest price = rank 1)

df["price"].rank(ascending= False)

0    10.0
1     9.0
2     5.0
3     7.0
4     1.0
5     3.0
6     8.0
7     2.0
8     6.0
9     4.0
Name: price, dtype: float64

In [159]:
# Task 3.3 Find the top 3 orders by total_amount

print("Top 3 orders by total amount")
descending_sort.head(3)

Top 3 orders by total amount

,order_id,customer_id,product_id,quantity,price,order_date,total_amount,price_with_tax
4,5,1009,106,4,74.511018,2021-01-05,298.044073,312.946277
5,6,1001,102,3,70.628991,2021-01-06,211.886972,222.481321
6,7,1003,107,4,48.263789,2021-01-07,193.055157,202.707914

In [160]:
# Task 3.4 Sort the orders by date and quantity

df.sort_values(["order_date", "quantity"])

,order_id,customer_id,product_id,quantity,price,order_date,total_amount,price_with_tax
0,1,1008,105,3,29.325423,2021-01-01,87.976268,92.375082
1,2,1000,101,4,32.731698,2021-01-02,130.926791,137.473131
2,3,1000,107,2,67.374953,2021-01-03,134.749905,141.487400
3,4,1004,107,3,53.093335,2021-01-04,159.280006,167.244006
4,5,1009,106,4,74.511018,2021-01-05,298.044073,312.946277
5,6,1001,102,3,70.628991,2021-01-06,211.886972,222.481321
6,7,1003,107,4,48.263789,2021-01-07,193.055157,202.707914
7,8,1010,109,2,71.342279,2021-01-08,142.684558,149.818786
8,9,1002,106,2,66.276559,2021-01-09,132.553117,139.180773
9,10,1000,104,2,70.429624,2021-01-10,140.859247,147.902209

#### 4. Function Application

In [161]:
# 4.1 Create a function that categorizes total_amount into ‘High’ (>$200), ‘Medium’ ($100-$200), and ‘Low’ (<$100)

def amount_category(total_amount):
    if total_amount > 200:
        return "High"
    elif total_amount < 100:
        return "Low"
    else:
        return "Medium"

In [162]:
# 4.2 Apply this function to create a new column ‘order_category’

df["category"] = df['total_amount'].apply(amount_category)
df

,order_id,customer_id,product_id,quantity,price,order_date,total_amount,price_with_tax,category
0,1,1008,105,3,29.325423,2021-01-01,87.976268,92.375082,Low
1,2,1000,101,4,32.731698,2021-01-02,130.926791,137.473131,Medium
2,3,1000,107,2,67.374953,2021-01-03,134.749905,141.487400,Medium
3,4,1004,107,3,53.093335,2021-01-04,159.280006,167.244006,Medium
4,5,1009,106,4,74.511018,2021-01-05,298.044073,312.946277,High
5,6,1001,102,3,70.628991,2021-01-06,211.886972,222.481321,High
6,7,1003,107,4,48.263789,2021-01-07,193.055157,202.707914,Medium
7,8,1010,109,2,71.342279,2021-01-08,142.684558,149.818786,Medium
8,9,1002,106,2,66.276559,2021-01-09,132.553117,139.180773,Medium
9,10,1000,104,2,70.429624,2021-01-10,140.859247,147.902209,Medium

In [163]:
# 4.3 Format the price and total_amount columns to display as currency with 2 decimal places

def my_format(x):
    return f"${x:.2f}"

df["price"].apply(format)
df["total_amount"].apply(format)
df

,order_id,customer_id,product_id,quantity,price,order_date,total_amount,price_with_tax,category
0,1,1008,105,3,29.325423,2021-01-01,87.976268,92.375082,Low
1,2,1000,101,4,32.731698,2021-01-02,130.926791,137.473131,Medium
2,3,1000,107,2,67.374953,2021-01-03,134.749905,141.487400,Medium
3,4,1004,107,3,53.093335,2021-01-04,159.280006,167.244006,Medium
4,5,1009,106,4,74.511018,2021-01-05,298.044073,312.946277,High
5,6,1001,102,3,70.628991,2021-01-06,211.886972,222.481321,High
6,7,1003,107,4,48.263789,2021-01-07,193.055157,202.707914,Medium
7,8,1010,109,2,71.342279,2021-01-08,142.684558,149.818786,Medium
8,9,1002,106,2,66.276559,2021-01-09,132.553117,139.180773,Medium
9,10,1000,104,2,70.429624,2021-01-10,140.859247,147.902209,Medium

In [164]:
# 4.4 Calculate the cumulative sum of total_amount ordered by date

total_revenue = df["total_amount"].sum()
print("Cumulative revenue is:")
print(my_format(total_revenue))

Cumulative revenue is:
$1632.02

#### 5. Index Operations

In [165]:

# 5.1  Set the order_date as the index of the DataFrame

df = df.set_index("order_date")
df

,order_id,customer_id,product_id,quantity,price,total_amount,price_with_tax,category
order_date,,,,,,,,
2021-01-01,1,1008,105,3,29.325423,87.976268,92.375082,Low
2021-01-02,2,1000,101,4,32.731698,130.926791,137.473131,Medium
2021-01-03,3,1000,107,2,67.374953,134.749905,141.487400,Medium
2021-01-04,4,1004,107,3,53.093335,159.280006,167.244006,Medium
2021-01-05,5,1009,106,4,74.511018,298.044073,312.946277,High
2021-01-06,6,1001,102,3,70.628991,211.886972,222.481321,High
2021-01-07,7,1003,107,4,48.263789,193.055157,202.707914,Medium
2021-01-08,8,1010,109,2,71.342279,142.684558,149.818786,Medium
2021-01-09,9,1002,106,2,66.276559,132.553117,139.180773,Medium
2021-01-10,10,1000,104,2,70.429624,140.859247,147.902209,Medium

In [166]:
# 5.2 Select all orders from the first 5 days

df.head()

,order_id,customer_id,product_id,quantity,price,total_amount,price_with_tax,category
order_date,,,,,,,,
2021-01-01,1,1008,105,3,29.325423,87.976268,92.375082,Low
2021-01-02,2,1000,101,4,32.731698,130.926791,137.473131,Medium
2021-01-03,3,1000,107,2,67.374953,134.749905,141.487400,Medium
2021-01-04,4,1004,107,3,53.093335,159.280006,167.244006,Medium
2021-01-05,5,1009,106,4,74.511018,298.044073,312.946277,High

In [173]:
# 5.3 Reset the index back to default numeric indices

df =df.reset_index()
df

,order_date,order_id,customer_id,product_id,quantity,price,total_amount,price_with_tax,category
0,2021-01-01,1,1008,105,3,29.325423,87.976268,92.375082,Low
1,2021-01-02,2,1000,101,4,32.731698,130.926791,137.473131,Medium
2,2021-01-03,3,1000,107,2,67.374953,134.749905,141.487400,Medium
3,2021-01-04,4,1004,107,3,53.093335,159.280006,167.244006,Medium
4,2021-01-05,5,1009,106,4,74.511018,298.044073,312.946277,High
5,2021-01-06,6,1001,102,3,70.628991,211.886972,222.481321,High
6,2021-01-07,7,1003,107,4,48.263789,193.055157,202.707914,Medium
7,2021-01-08,8,1010,109,2,71.342279,142.684558,149.818786,Medium
8,2021-01-09,9,1002,106,2,66.276559,132.553117,139.180773,Medium
9,2021-01-10,10,1000,104,2,70.429624,140.859247,147.902209,Medium

In [175]:
#5.4 Create a new copy of the DataFrame with order_id as the index

copydf = df.copy()
copydf.set_index("order_id")

,order_date,customer_id,product_id,quantity,price,total_amount,price_with_tax,category
order_id,,,,,,,,
1,2021-01-01,1008,105,3,29.325423,87.976268,92.375082,Low
2,2021-01-02,1000,101,4,32.731698,130.926791,137.473131,Medium
3,2021-01-03,1000,107,2,67.374953,134.749905,141.487400,Medium
4,2021-01-04,1004,107,3,53.093335,159.280006,167.244006,Medium
5,2021-01-05,1009,106,4,74.511018,298.044073,312.946277,High
6,2021-01-06,1001,102,3,70.628991,211.886972,222.481321,High
7,2021-01-07,1003,107,4,48.263789,193.055157,202.707914,Medium
8,2021-01-08,1010,109,2,71.342279,142.684558,149.818786,Medium
9,2021-01-09,1002,106,2,66.276559,132.553117,139.180773,Medium
10,2021-01-10,1000,104,2,70.429624,140.859247,147.902209,Medium